In [34]:

import pandas as pd
df=pd.read_excel("Movies_Dataset.xlsx")
df

     Movie Name      Genre  Release_Year  IMDb_Rating  Revenue
0       Movie 1     Sci-Fi          2000          6.0  1680.53
1       Movie 2  Adventure          2000          2.2   987.24
2       Movie 3    Romance          2002          5.2  1122.13
3       Movie 4    Romance          2001          4.5   581.84
4       Movie 5     Action          2012          6.6  1205.51
..          ...        ...           ...          ...      ...
995   Movie 996     Sci-Fi          2013          8.7   456.39
996   Movie 997  Adventure          1993          6.2  1255.27
997   Movie 998    Fantasy          2016          8.1  1161.96
998   Movie 999     Action          1996          8.9   941.67
999  Movie 1000     Horror          1995          9.4  1390.70

[1000 rows x 5 columns]

In [7]:
# 1. Select all movies in the "Action" genre.
movies=df[df["Genre"] == "Action"]
movies

    Movie Name   Genre  Release_Year  IMDb_Rating  Revenue
4      Movie 5  Action          2012          6.6  1205.51
34    Movie 35  Action          2009          8.7   545.60
64    Movie 65  Action          2023          7.7  1137.79
65    Movie 66  Action          1999          3.1  1335.85
73    Movie 74  Action          2001          4.1   350.80
..         ...     ...           ...          ...      ...
930  Movie 931  Action          1994          8.6  1863.66
944  Movie 945  Action          2004          7.5  1709.81
980  Movie 981  Action          2022          5.2    28.40
988  Movie 989  Action          2023          4.1   231.67
998  Movie 999  Action          1996          8.9   941.67

[104 rows x 5 columns]

In [9]:
#2. Select movies released after 2000. 
movies=df[df["Release_Year"] > 2000]
print(movies)

    Movie Name     Genre  Release_Year  IMDb_Rating  Revenue
2      Movie 3   Romance          2002          5.2  1122.13
3      Movie 4   Romance          2001          4.5   581.84
4      Movie 5    Action          2012          6.6  1205.51
6      Movie 7   Mystery          2021          5.1  1683.99
7      Movie 8    Comedy          2005          4.0  1062.13
..         ...       ...           ...          ...      ...
988  Movie 989    Action          2023          4.1   231.67
989  Movie 990   Fantasy          2004          1.6  1056.58
991  Movie 992  Thriller          2004          9.2   251.25
995  Movie 996    Sci-Fi          2013          8.7   456.39
997  Movie 998   Fantasy          2016          8.1  1161.96

[518 rows x 5 columns]

In [10]:
#3. Select movies with an IMDb rating greater than 8.5. 
movies=df[df["IMDb_Rating"] > 8.5]
movies

     Movie Name      Genre  Release_Year  IMDb_Rating  Revenue
34     Movie 35     Action          2009          8.7   545.60
51     Movie 52    Mystery          1998          9.0  1089.93
56     Movie 57     Comedy          1993          9.2  1586.13
74     Movie 75  Adventure          1999          8.6  1688.49
81     Movie 82    Mystery          1997          8.6  1238.32
..          ...        ...           ...          ...      ...
991   Movie 992   Thriller          2004          9.2   251.25
992   Movie 993     Horror          1985          9.6   951.23
995   Movie 996     Sci-Fi          2013          8.7   456.39
998   Movie 999     Action          1996          8.9   941.67
999  Movie 1000     Horror          1995          9.4  1390.70

[148 rows x 5 columns]

In [13]:
#4. Select only "Movie Name" and "Genre" columns. 
df[["Movie Name","Genre"]]

     Movie Name      Genre
0       Movie 1     Sci-Fi
1       Movie 2  Adventure
2       Movie 3    Romance
3       Movie 4    Romance
4       Movie 5     Action
..          ...        ...
995   Movie 996     Sci-Fi
996   Movie 997  Adventure
997   Movie 998    Fantasy
998   Movie 999     Action
999  Movie 1000     Horror

[1000 rows x 2 columns]

In [15]:
#5. Select movies released between 1990 and 2010. 
movies=df[(df["Release_Year"] > 1990) & (df["Release_Year"] < 2010)]
movies

     Movie Name      Genre  Release_Year  IMDb_Rating  Revenue
0       Movie 1     Sci-Fi          2000          6.0  1680.53
1       Movie 2  Adventure          2000          2.2   987.24
2       Movie 3    Romance          2002          5.2  1122.13
3       Movie 4    Romance          2001          4.5   581.84
5       Movie 6    Fantasy          1997          2.4   485.22
..          ...        ...           ...          ...      ...
991   Movie 992   Thriller          2004          9.2   251.25
994   Movie 995     Sci-Fi          1997          2.0   342.98
996   Movie 997  Adventure          1993          6.2  1255.27
998   Movie 999     Action          1996          8.9   941.67
999  Movie 1000     Horror          1995          9.4  1390.70

[459 rows x 5 columns]

In [22]:
#6. Count the number of movies in each genre. 
df["Genre"].value_counts()

Genre
Drama        113
Comedy       110
Fantasy      107
Thriller     107
Action       104
Adventure     96
Sci-Fi        93
Romance       91
Horror        90
Mystery       89
Name: count, dtype: int64

In [24]:
#7. Find the highest IMDb-rated movie. 
df[df["IMDb_Rating"]==df.IMDb_Rating.max()]

    Movie Name    Genre  Release_Year  IMDb_Rating  Revenue
106  Movie 107  Romance          2007         10.0  1837.45
241  Movie 242   Comedy          2006         10.0   802.61
472  Movie 473  Fantasy          1985         10.0   845.18
564  Movie 565   Action          2020         10.0   943.50
610  Movie 611  Mystery          2017         10.0  1355.06
628  Movie 629  Mystery          1994         10.0   644.31

In [26]:
#8. Find the average IMDb rating of all movies.
df.IMDb_Rating.mean()

np.float64(5.458600000000001)

In [27]:
#9. Find the total box office collection of all movies. 
df.Revenue.sum()

np.float64(1049716.26)

In [28]:
#10. Select movies with box office earnings greater than 500 million. 
df[df['Revenue'] > 500]

     Movie Name      Genre  Release_Year  IMDb_Rating  Revenue
0       Movie 1     Sci-Fi          2000          6.0  1680.53
1       Movie 2  Adventure          2000          2.2   987.24
2       Movie 3    Romance          2002          5.2  1122.13
3       Movie 4    Romance          2001          4.5   581.84
4       Movie 5     Action          2012          6.6  1205.51
..          ...        ...           ...          ...      ...
993   Movie 994  Adventure          1989          7.3  1273.65
996   Movie 997  Adventure          1993          6.2  1255.27
997   Movie 998    Fantasy          2016          8.1  1161.96
998   Movie 999     Action          1996          8.9   941.67
999  Movie 1000     Horror          1995          9.4  1390.70

[774 rows x 5 columns]

In [3]:
#11. Rank movies based on IMDb rating. 
df['rank']=df['IMDb_Rating'].rank()
df

     Movie Name      Genre  Release_Year  IMDb_Rating  Revenue   rank
0       Movie 1     Sci-Fi          2000          6.0  1680.53  568.5
1       Movie 2  Adventure          2000          2.2   987.24  132.0
2       Movie 3    Romance          2002          5.2  1122.13  471.5
3       Movie 4    Romance          2001          4.5   581.84  391.5
4       Movie 5     Action          2012          6.6  1205.51  647.5
..          ...        ...           ...          ...      ...    ...
995   Movie 996     Sci-Fi          2013          8.7   456.39  869.5
996   Movie 997  Adventure          1993          6.2  1255.27  594.5
997   Movie 998    Fantasy          2016          8.1  1161.96  801.5
998   Movie 999     Action          1996          8.9   941.67  896.5
999  Movie 1000     Horror          1995          9.4  1390.70  947.0

[1000 rows x 6 columns]

In [9]:
#12. Sort movies by release year in descending order. 
df1=df.sort_values("Movie Name", ascending=False)
df1

     Movie Name      Genre  Release_Year  IMDb_Rating  Revenue
998   Movie 999     Action          1996          8.9   941.67
997   Movie 998    Fantasy          2016          8.1  1161.96
996   Movie 997  Adventure          1993          6.2  1255.27
995   Movie 996     Sci-Fi          2013          8.7   456.39
994   Movie 995     Sci-Fi          1997          2.0   342.98
..          ...        ...           ...          ...      ...
999  Movie 1000     Horror          1995          9.4  1390.70
99    Movie 100     Comedy          2013          7.3   607.56
12     Movie 10      Drama          1996          3.2  1352.66
9      Movie 10      Drama          1996          3.2  1352.66
0       Movie 1     Sci-Fi          2000          6.0  1680.53

[1000 rows x 5 columns]

In [14]:
df_rename=df.rename(columns={"Movie Name":"Movie_Name"})
df_rename

     Movie_Name      Genre  Release_Year  IMDb_Rating  Revenue
0       Movie 1     Sci-Fi          2000          6.0  1680.53
1       Movie 2  Adventure          2000          2.2   987.24
2       Movie 3    Romance          2002          5.2  1122.13
3       Movie 4    Romance          2001          4.5   581.84
4       Movie 5     Action          2012          6.6  1205.51
..          ...        ...           ...          ...      ...
995   Movie 996     Sci-Fi          2013          8.7   456.39
996   Movie 997  Adventure          1993          6.2  1255.27
997   Movie 998    Fantasy          2016          8.1  1161.96
998   Movie 999     Action          1996          8.9   941.67
999  Movie 1000     Horror          1995          9.4  1390.70

[1000 rows x 5 columns]

In [18]:
df

     Movie Name      Genre  Release_Year  IMDb_Rating  Revenue
0       Movie 1     Sci-Fi          2000          6.0  1680.53
1       Movie 2  Adventure          2000          2.2   987.24
2       Movie 3    Romance          2002          5.2  1122.13
3       Movie 4    Romance          2001          4.5   581.84
4       Movie 5     Action          2012          6.6  1205.51
..          ...        ...           ...          ...      ...
995   Movie 996     Sci-Fi          2013          8.7   456.39
996   Movie 997  Adventure          1993          6.2  1255.27
997   Movie 998    Fantasy          2016          8.1  1161.96
998   Movie 999     Action          1996          8.9   941.67
999  Movie 1000     Horror          1995          9.4  1390.70

[1000 rows x 5 columns]

In [19]:
#13. Find all duplicate movie names (if any)
df[df.duplicated(subset=['Movie Name'])]

   Movie Name      Genre  Release_Year  IMDb_Rating  Revenue
12   Movie 10      Drama          1996          3.2  1352.66
13   Movie 11    Mystery          2003          6.3   596.43
14   Movie 12     Sci-Fi          1988          3.0  1134.01
20   Movie 16     Comedy          2006          2.3  1322.79
21   Movie 17     Horror          2007          6.2  1114.31
22   Movie 18  Adventure          1998          7.9  1426.73
23   Movie 19     Comedy          1986          6.0  1783.44
24   Movie 20    Fantasy          1982          6.9  1598.08

In [35]:
df1=df.copy()
df1

     Movie Name      Genre  Release_Year  IMDb_Rating  Revenue
0       Movie 1     Sci-Fi          2000          6.0  1680.53
1       Movie 2  Adventure          2000          2.2   987.24
2       Movie 3    Romance          2002          5.2  1122.13
3       Movie 4    Romance          2001          4.5   581.84
4       Movie 5     Action          2012          6.6  1205.51
..          ...        ...           ...          ...      ...
995   Movie 996     Sci-Fi          2013          8.7   456.39
996   Movie 997  Adventure          1993          6.2  1255.27
997   Movie 998    Fantasy          2016          8.1  1161.96
998   Movie 999     Action          1996          8.9   941.67
999  Movie 1000     Horror          1995          9.4  1390.70

[1000 rows x 5 columns]

In [36]:
#14. Remove duplicate movie names.
df1=df1.drop_duplicates(subset=['Movie Name'])
df1

     Movie Name      Genre  Release_Year  IMDb_Rating  Revenue
0       Movie 1     Sci-Fi          2000          6.0  1680.53
1       Movie 2  Adventure          2000          2.2   987.24
2       Movie 3    Romance          2002          5.2  1122.13
3       Movie 4    Romance          2001          4.5   581.84
4       Movie 5     Action          2012          6.6  1205.51
..          ...        ...           ...          ...      ...
995   Movie 996     Sci-Fi          2013          8.7   456.39
996   Movie 997  Adventure          1993          6.2  1255.27
997   Movie 998    Fantasy          2016          8.1  1161.96
998   Movie 999     Action          1996          8.9   941.67
999  Movie 1000     Horror          1995          9.4  1390.70

[992 rows x 5 columns]

In [37]:
#15. Replace "Sci-Fi" genre with "Science Fiction"
df1['Genre']=df1['Genre'].replace("Sci-Fi","Science Fiction")
df1

C:\Users\TEJASWINI\AppData\Local\Temp\ipykernel_11408\1225174652.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df1['Genre']=df1['Genre'].replace("Sci-Fi","Science Fiction")

     Movie Name            Genre  Release_Year  IMDb_Rating  Revenue
0       Movie 1  Science Fiction          2000          6.0  1680.53
1       Movie 2        Adventure          2000          2.2   987.24
2       Movie 3          Romance          2002          5.2  1122.13
3       Movie 4          Romance          2001          4.5   581.84
4       Movie 5           Action          2012          6.6  1205.51
..          ...              ...           ...          ...      ...
995   Movie 996  Science Fiction          2013          8.7   456.39
996   Movie 997        Adventure          1993          6.2  1255.27
997   Movie 998          Fantasy          2016          8.1  1161.96
998   Movie 999           Action          1996          8.9   941.67
999  Movie 1000           Horror          1995          9.4  1390.70

[992 rows x 5 columns]

In [38]:
print(df1.columns.tolist())

['Movie Name', 'Genre', 'Release_Year', 'IMDb_Rating', 'Revenue']

In [39]:
#16. Select the first 10 movies
df['Movie Name'].head(10)

0     Movie 1
1     Movie 2
2     Movie 3
3     Movie 4
4     Movie 5
5     Movie 6
6     Movie 7
7     Movie 8
8     Movie 9
9    Movie 10
Name: Movie Name, dtype: object

In [40]:
#17. Select the last 5 movies. 
df['Movie Name'].tail()

995     Movie 996
996     Movie 997
997     Movie 998
998     Movie 999
999    Movie 1000
Name: Movie Name, dtype: object

In [41]:
#18. Group movies by genre and find the average IMDb rating for each genre. 
df1.groupby('Genre')['IMDb_Rating'].mean()

Genre
Action             5.670192
Adventure          4.982105
Comedy             5.466667
Drama              5.191071
Fantasy            5.183962
Horror             5.810112
Mystery            5.772727
Romance            5.938462
Science Fiction    5.471739
Thriller           5.267290
Name: IMDb_Rating, dtype: float64

In [42]:
#19. Find the number of movies released in each year
df1.groupby('Release_Year').size()

Release_Year
1980    26
1981    17
1982    20
1983    16
1984    16
1985    28
1986    20
1987    17
1988    19
1989    30
1990    21
1991    21
1992    26
1993    21
1994    23
1995    27
1996    25
1997    22
1998    28
1999    25
2000    29
2001    23
2002    24
2003    24
2004    20
2005    21
2006    22
2007    28
2008    24
2009    21
2010    20
2011    23
2012    20
2013    26
2014    20
2015    23
2016    14
2017    18
2018    18
2019    15
2020    20
2021    16
2022    25
2023    18
2024    32
dtype: int64

In [44]:
#20. Find the total box office collection per genre. 
df1.groupby('Genre')['Revenue'].sum()

Genre
Action             111137.94
Adventure          102437.69
Comedy             119580.40
Drama              118958.66
Fantasy            108251.78
Horror              89281.21
Mystery             98236.50
Romance             94413.72
Science Fiction     84677.79
Thriller           112412.12
Name: Revenue, dtype: float64